In [1]:
import pandas as pd

In [2]:
from sqlalchemy import create_engine

In [3]:
engine = create_engine('postgresql://root:root@localhost:5431/ny_taxi')

In [4]:
conn = engine.connect()

In [5]:
sql = """
SELECT COUNT(1)
FROM yellow_taxi_data
"""

df = pd.read_sql(sql, con=engine)

In [7]:
df

     count
0  1369765

In [8]:
sql = """
SELECT COUNT(1)
FROM yellow_taxi_data
WHERE DATE_TRUNC('day', tpep_pickup_datetime) = '2021-01-15'
"""

df = pd.read_sql(sql, con=engine)

In [9]:
df

   count
0  53024

In [10]:
sql = """
SELECT DATE_TRUNC('day', tpep_pickup_datetime) AS day, MAX(tip_amount) AS max_tip
FROM yellow_taxi_data
GROUP BY day
ORDER BY max_tip DESC
"""

df = pd.read_sql(sql, con=engine)

In [11]:
df

          day  max_tip
0  2021-01-20  1140.44
1  2021-01-04   696.48
2  2021-01-03   369.40
3  2021-01-26   250.00
4  2021-01-09   230.00
5  2021-01-19   200.80
6  2021-01-30   199.12
7  2021-01-12   192.61
8  2021-01-21   166.00
9  2021-01-01   158.00
10 2021-01-05   151.00
11 2021-01-11   145.00
12 2021-01-24   122.00
13 2021-01-02   109.15
14 2021-01-31   108.50
15 2021-01-25   100.16
16 2021-01-06   100.00
17 2021-01-16   100.00
18 2021-01-23   100.00
19 2021-01-27   100.00
20 2021-01-08   100.00
21 2021-01-13   100.00
22 2021-01-15    99.00
23 2021-01-14    95.00
24 2021-01-07    95.00
25 2021-01-22    92.55
26 2021-01-10    91.00
27 2021-01-18    90.00
28 2021-01-28    77.14
29 2021-01-29    75.00
30 2021-01-17    65.00
31 2020-12-31     4.08
32 2021-02-22     1.76
33 2021-02-01     1.54
34 2008-12-31     0.00
35 2009-01-01     0.00

In [12]:
sql = """
SELECT
    CONCAT(zpu."Borough", '/', zpu."Zone") AS pickup_loc,
    CONCAT(zdo."Borough", '/', zdo."Zone") AS dropoff_loc,
    COUNT(t.index) AS "amount_of_trips"
FROM
    yellow_taxi_data t LEFT JOIN zones zpu
        ON t."PULocationID" = zpu."LocationID"
    LEFT JOIN zones zdo
        ON t."DOLocationID" = zdo."LocationID"
WHERE t."PULocationID" = (SELECT "LocationID" FROM zones zpu WHERE zpu."Zone" in('Central Park'))
GROUP BY
1,2 
ORDER BY
amount_of_trips DESC;
"""

df = pd.read_sql(sql, con=engine)

In [13]:
df

                 pickup_loc                       dropoff_loc  amount_of_trips
0    Manhattan/Central Park   Manhattan/Upper East Side North             2234
1    Manhattan/Central Park   Manhattan/Upper East Side South             1842
2    Manhattan/Central Park            Manhattan/Central Park             1664
3    Manhattan/Central Park   Manhattan/Upper West Side South             1635
4    Manhattan/Central Park   Manhattan/Upper West Side North             1516
..                      ...                               ...              ...
180  Manhattan/Central Park                Bronx/Country Club                1
181  Manhattan/Central Park            Manhattan/Battery Park                1
182  Manhattan/Central Park               Bronx/Fordham South                1
183  Manhattan/Central Park  Queens/Forest Park/Highland Park                1
184  Manhattan/Central Park                 Bronx/Hunts Point                1

[185 rows x 3 columns]

In [14]:
sql = """
SELECT
    CONCAT(zpu."Borough", '/', zpu."Zone") AS pickup_loc,
    CONCAT(zdo."Borough", '/', zdo."Zone") AS dropoff_loc,
    AVG(t.total_amount) AS average_price
FROM
    yellow_taxi_data t LEFT JOIN zones zpu
        ON t."PULocationID" = zpu."LocationID"
    LEFT JOIN zones zdo
        ON t."DOLocationID" = zdo."LocationID"
GROUP BY
1, 2 
ORDER BY
average_price DESC;
"""

df = pd.read_sql(sql, con=engine)

In [15]:
df

,pickup_loc,dropoff_loc,average_price
0,Manhattan/Alphabet City,Unknown/,2292.400
1,Manhattan/Union Sq,Brooklyn/Canarsie,262.852
2,Brooklyn/Ocean Hill,Unknown/,234.510
3,Queens/Long Island City/Hunters Point,Manhattan/Clinton East,207.610
4,Brooklyn/Boerum Hill,Queens/Woodside,200.300
...,...,...,...
27696,Unknown/NV,Queens/Bellerose,0.000
27697,Manhattan/Lower East Side,Queens/North Corona,-7.000
27698,Queens/Briarwood/Jamaica Hills,Queens/Willets Point,-32.500
27699,Manhattan/East Chelsea,Queens/Queensboro Hill,-43.800
27700,Manhattan/Penn Station/Madison Sq West,Queens/Howard Beach,-54.800